CodeRes = {
	[1000] = "登录失败";
	[1001] = "电话号码已注册";
	[1002] = "两个密码不相同";
	[1003] = "登录失败，账号或者密码错误";
	[1004] = "注册的不是手机号码";
	[1005] = "密码格式错误";
	[1006] = "邀请码不正确";
	[1101] = "房间不存在";
	[1102] = "红包不存在";
	[1103] = "红包已抢完";
	[1104] = "金币不足";
	[1105] = "已经抢过了";
	[1106] = "红包没开完，不能查看记录";
	[1107] = "抢红包失败，红包冷却中";
	[1108] = "代理不能玩游戏";
	[1201] = "昵称格式错误";
	[1202] = "头像格式错误";
	[1203] = "个人资料格式错误";
	[1204] = "没有个人资料修改";
	[1205] = "金币不足";
	[1206] = "玩家不存在";
	[2000] = "支付失败";
	[2101] = "金币不足";
	[2201] = "银行金币不足";
	[2202] = "取款密码错误";
	[2103] = "存款时金币错误";
	[2204] = "取款密码错误";
	[2401] = "转帐金币错误";
	[2402] = "银行金币余额不足";	
	[2403] = "目标玩家不存在";	
	[2404] = "权限不足";	
	[2405] = "密码错误";	
	[2406] = "转账-机器人不能转出";	
	[2407] = "不能给自己转账";	
	[2701] = "新密码格式错误";	
	[2702] = "旧密码错误";	
	-- [2402] = "转帐金币错误";	        
	    
} ;
		
function CodeRes.showTip(id) 
	
	id = tonumber(id) or  0 
	local tip = CodeRes[id] or "错误码:" .. id;	 
	if tip then 
		local layout=  Utils.createPop(1, {ms = tip});
	    layout:setName("popwin")
		local scene = display.getRunningScene()
	    scene:addChild(layout); 
	    layout:setPosition((display.width - layout.size.width)/2, (display.height - layout.size.height)/2);
			
	end 
end 